src/Documents/КорректировкаЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаЗаказаПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаявкиПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ОтказыПоЗаявкам</xr:Item>
				<xr:Item>InformationRegister.ИсторияЗаявокПокупателя</xr:Item>
				<xr:Item>InformationRegister.ДокументыКорректировок</xr:Item>
				<xr:Item>InformationRegister.ВозможныеЗаменыНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукционПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоступленияПоставщика</Name>
					<Comment>Номер поступления поставщика (только для загрузки ответа ftp)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗамена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияЗамена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОтказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГарантированныйЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОжидаемыйЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеСтрокиЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПричиныОтказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженИзОП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ДокументыКорректировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДокументыКорректировок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументКорректировки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/КорректировкаЗаказаПоставщику/Ext/ObjectModule.bsl
Перем мЗарегистрироватьИзмененияДляОкнаПоставщика;

Функция ПолучитьОстаткиПоРегиструЗаказовПостащикам(вхОснование) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.СтрокаЗаказа КАК СтрокаЗаказа,
	|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения.Владелец КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
	|	ЗаказыПоставщикамОстатки.СуммаУпрОстаток КАК Всего,
	|	ЗаказыПоставщикамОстатки.СостояниеСтрокиЗаказа КАК СостояниеСтрокиЗаказа,
	|	ЗаказыПоставщикамОстатки.СтрокаЗаказа.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказыПоставщикамОстатки.СтрокаЗаказа.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, СтрокаЗаказа.ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикамОстатки";
	
	//Запрос.УстановитьПараметр("Дата", Дата);
	Если ЗначениеЗаполнено(вхОснование) Тогда
		Запрос.УстановитьПараметр("ЗаказПоставщику", вхОснование);
	Иначе
		Запрос.УстановитьПараметр("ЗаказПоставщику", ДокументОснование);
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.КорректировкаЗаказаПоставщику.ВыполнитьПроведение(Ссылка, Отказ);
	РегистрыСведений.ДокументыКорректировок.УстановитьКорректировку(Движения.ДокументыКорректировок, Ссылка.ДокументОснование, Ссылка);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуТоваров(вхОснование = Неопределено) Экспорт
	Товары.Очистить();
	
	ТабТоваров = ПолучитьОстаткиПоРегиструЗаказовПостащикам(вхОснование);
	
	Для Каждого ТекСтрокаТовары Из ТабТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		//НоваяСтрока.Всего = ТекСтрокаТовары.Всего;
		НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
		НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
		НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		//НоваяСтрока.СостояниеСтрокиЗаказа = ТекСтрокаТовары.СостояниеСтрокиЗаказа;
		//НоваяСтрока.СтавкаНДС = ТекСтрокаТовары.СтавкаНДС;
		НоваяСтрока.СтрокаЗаказа = ТекСтрокаТовары.СтрокаЗаказа;
		НоваяСтрока.Сумма = ТекСтрокаТовары.Всего;//сумма всегда включает НДС
		НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(ТекСтрокаТовары.СтрокаЗаказа.СтавкаНДС));
		НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма/НоваяСтрока.Количество,2);
		НоваяСтрока.Комментарий = ТекСтрокаТовары.Комментарий;
		//НоваяСтрока.СуммаНДС = ТекСтрокатовары.СуммаНДС;
		//НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;
	
КонецПроцедуры

Процедура СобратьПредыдущиеПричиныОтказов()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Причины.СтрокаЗаявки,
	|	Причины.ПричинаОтказа,
	|	Причины.Количество,
	|	Причины.КлючСвязи,
	|	Причины.ЗагруженИзОП
	|ИЗ
	|	Документ.ЗаказПоставщику.ПричиныОтказов КАК Причины
	|ГДЕ
	|	Причины.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КоррПричины.СтрокаЗаявки,
	|	КоррПричины.ПричинаОтказа,
	|	КоррПричины.Количество,
	|	КоррПричины.КлючСвязи,
	|	КоррПричины.ЗагруженИзОП
	|ИЗ
	|	Документ.КорректировкаЗаказаПоставщику.ПричиныОтказов КАК КоррПричины
	|ГДЕ
	|	КоррПричины.Ссылка.ДокументОснование = &ДокументОснование
	|	И КоррПричины.Ссылка.Дата < &Дата"
	);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Результат, ПричиныОтказов);
		ПричиныОтказов.Свернуть("СтрокаЗаявки,ПричинаОтказа,КлючСвязи,ЗагруженИзОП", "Количество");
		Для Каждого Товар Из Товары Цикл
			пар = Новый Структура("СтрокаЗаявки", Товар.СтрокаЗаявки);
			СтрокиОтказов = ПричиныОтказов.НайтиСтроки(пар);
			Если СтрокиОтказов.Количество() > 0 Тогда
				Товар.КоличествоОтказ = 0;
				Для Каждого СтрокаОтказа Из СтрокиОтказов Цикл
					Товар.КоличествоОтказ =Товар.КоличествоОтказ + СтрокаОтказа.Количество;
				КонецЦикла;
				Товар.Сумма = (Товар.Количество - Товар.КоличествоОтказ) * Товар.Цена;
				Товар.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Товар.Сумма, УчитыватьНДС, СуммаВключаетНДС, Товар.СтавкаНДС);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		//СобратьПредыдущиеПричиныОтказов();
		Возврат;
	//ИначеЕсли НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
	//    Сообщить("Изменить документ вручную пока невозможно.");
	//	Отказ = Истина;
	//	Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УчНДС = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Организация, "УчитыватьНДС");
	
	Для Каждого Товар Из Товары Цикл
		Товар.Сумма = (Товар.Количество - Товар.КоличествоОтказ) * Товар.Цена;
		Товар.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Товар.Сумма, УчНДС, Истина, Товар.СтавкаНДС);
	КонецЦикла;
	
	Если Не ЭтоНовый() и не РольДоступна("ПолныеПрава") Тогда 
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение Или  РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда 
			СС = ЭтотОбъект.Ссылка;
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КорректировкаЗаказаПоставщику.Ссылка
			|ИЗ
			|	Документ.КорректировкаЗаказаПоставщику КАК КорректировкаЗаказаПоставщику
			|ГДЕ
			|	КорректировкаЗаказаПоставщику.ДокументОснование = &ДокументОснование
			|	И КорректировкаЗаказаПоставщику.Проведен
			|	И КорректировкаЗаказаПоставщику.Дата >= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	КорректировкаЗаказаПоставщику.Дата УБЫВ"
			);
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			Запрос.УстановитьПараметр("Дата", Дата);
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда 
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Если Ссылка <> Выборка.Ссылка Тогда 
					Сообщить("Нельзя изменять состояние проведения промежуточных корректировок!");
					Отказ=Истина;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//ХХ-242{{
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ТОгда
		ОснованиеПроведено = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Проведен");
		Если Не ОснованиеПроведено Тогда
			Сообщить("Нельзя вводить корректировку на основании непроведенного документа!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//}}
	
	Если НЕ ЗначениеЗаполнено(ТорговаяТочка) Тогда
		ТорговаяТочка = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "ОсновнаяТорговаяТочка");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование.Контрагент) И ДокументОснование.Контрагент.РаботатьСОкномПоставщика И НЕ ДокументОснование.ПометкаУдаления И НЕ ДополнительныеСвойства.Свойство("ЗагруженоИзОП") Тогда
		мЗарегистрироватьИзмененияДляОкнаПоставщика = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика, ЭтотОбъект);
	КонецЕсли;
	
	//Добавлено Валиахметов А.А. 01.03.2018 PK83-232				
	ЗаполнениеДокументов.ЗаполнитьКлючиСвязи(ЭтотОбъект);
	//Конец Добавлено Валиахметов А.А. 01.03.2018
	
	//Добавлено Валиахметов А.А. 07.03.2018 PK83-283				
	ОбщегоНазначения.ЗаполнитьДопСвойстваДокумента(ЭтотОбъект, РежимЗаписи);
	//Конец Добавлено Валиахметов А.А. 07.03.2018
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма") + ?(СуммаВключаетНДС, 0, Товары.Итог("СуммаНДС") + Услуги.Итог("СуммаНДС"));
	
	// + 20180918 Пушкин XX-628
	Если СтатусДокумента = Справочники.СтатусыДокументов.ОбработанПоставщиком И НЕ ЗначениеЗаполнено(ДатаПодтверждения) тогда
		ДатаПодтверждения = ТекущаяДата();
	КонецЕсли;
	// - 20180918 Пушкин XX-628
	
КонецПроцедуры

Процедура ЗаполнитьДляОтмены(ДанныеЗаполнения) Экспорт
	Дата = ТекущаяДата();
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
	Организация = ДанныеЗаполнения.Организация;
	Ответственный = ДанныеЗаполнения.Ответственный;
	Комментарий = ДанныеЗаполнения.Комментарий;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснование = ДанныеЗаполнения;
	Иначе
		ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	КонецЕсли;
	Склад = ДанныеЗаполнения.Склад;
	ВалютаДокумент = ДанныеЗаполнения.ВалютаДокумента;
	КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
	КурсВзаиморасчетов = ДанныеЗаполнения.КурсВзаиморасчетов;
	КонтактноеЛицоКонтрагента = ДанныеЗаполнения.КонтактноеЛицоКонтрагента;
	СуммаВключаетНДС = ДанныеЗаполнения.СуммаВключаетНДС;
	ТипЦен = ДанныеЗаполнения.ТипЦен;
	УчитыватьНДС = ДанныеЗаполнения.ТипЦен;
	ЭлектронныйАдрес = Данныезаполнения.ЭлектронныйАдрес;
	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляОкнаПоставщика Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъектВУзлах(ДокументОснование, Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика);
		//ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ДокументОснование, Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СозданВ77 = Ложь;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Документы.КорректировкаЗаказаПоставщику.ВыполнитьОтменуПроведения(Ссылка, Отказ);
КонецПроцедуры

мЗарегистрироватьИзмененияДляОкнаПоставщика = Ложь;
